title: Scheduled Task Creation with Suspicious Executable
description: Detects schtasks creating a task out of public or temp folders
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \schtasks.exe
    CommandLine|contains:
    - /create
    - /tr
    - \Temp\
    - \Users\Public\
  condition: selection
level: high
status: stable
id: 26d011b3-95d5-475d-8940-698c717fec1f
tags:
- attack.synthetic
author: System
