title: Encoded PowerShell Content
description: Detects PowerShell execution with base64 encoded commands
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    CommandLine|contains:
    - -enc
    - -EncodedCommand
    - '-e '
  condition: selection
level: medium
status: stable
id: 6580c764-a9de-4493-b503-8cd8be0a3a51
tags:
- attack.execution
- attack.t1059
author: System
