title: Shadow Copy Deletion
description: 'Ransomware behavior: deleting volume shadow copies'
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
    - \vssadmin.exe
    - \wmic.exe
    CommandLine|contains:
    - delete shadows
    - shadowcopy delete
  condition: selection
level: critical
status: stable
id: fb3c80dd-200e-409a-831c-b08bd3f955d4
tags:
- attack.synthetic
author: System
