title: Suspicious LSASS Access
description: Detects potential credential dumping via LSASS memory access
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \procdump.exe
    CommandLine|contains: lsass
  condition: selection
level: high
status: stable
id: d492294d-be6b-4a03-b3a7-e100b2085bc6
tags:
- attack.synthetic
author: System
